ibGraduateWork/src/DataProcessors/ЗаполнениеГрафика/ЗаполнениеГрафика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗаполнениеГрафика</name>
</mdclass:DataProcessor>

ibGraduateWork/src/InformationRegisters/ГрафикиРаботы/ГрафикиРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ГрафикиРаботы</name>
  <resources>
    <name>ЗначениеЧасы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗначениеДни</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ГрафикиРабот</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ibGraduateWork/src/DataProcessors/ЗаполнениеГрафика/ObjectModule.bsl
Процедура ЗаполнитьГрафик(ДатаНачала, ДатаОкончания, ГрафикРаботы) Экспорт 
	
	Набор = РегистрыСведений.ГрафикиРаботы.СоздатьНаборЗаписей();
	Набор.Отбор.ГрафикРаботы.Установить(ГрафикРаботы);
	
	Набор.Прочитать();
	
	ВыходныеДни = ГрафикРаботы.ВыходныеДни;
	КолвоЧасов = ГрафикРаботы.КоличествоЧасов;
	ЧислоСекундВСутках = 86400;
	
	Дат = ДатаНачала;
	Для к = 0 По Набор.Количество()-1 Цикл
		
		Запись = Набор[к];
		Если Запись.Дата < ДатаНачала Тогда
		    Продолжить;
		ИначеЕсли Запись.Дата =Дат Тогда
			Если Найти(ВыходныеДни, Строка(ДеньНедели(Дат))) Тогда
				Запись.ЗначениеЧасы = 0;
				Запись.ЗначениеДни = 0;
			Иначе	          
				Запись.ЗначениеЧасы = КолвоЧасов;
				Запись.ЗначениеДни = 1;                      
			КонецЕсли;
			Дат = Дат + ЧислоСекундВСутках;
		Иначе
			Пока Дат < Мин(Запись.Дата, ДатаОкончания) Цикл
				НоваяЗапись = Набор.Добавить();
				НоваяЗапись.Дата = Дат;
				НоваяЗапись.ГрафикРаботы = ГрафикРаботы;
				Если Найти(ВыходныеДни, Строка(ДеньНедели(Дат))) Тогда
					НоваяЗапись.ЗначениеЧасы = 0;
					НоваяЗапись.ЗначениеДни = 0;
				Иначе	          
					НоваяЗапись.ЗначениеЧасы = КолвоЧасов;
					НоваяЗапись.ЗначениеДни = 1;
				КонецЕсли; 
				Дат = Дат + ЧислоСекундВСутках;
			КонецЦикла; 
			Если Запись.Дата > ДатаОкончания Тогда
				Прервать;
			Иначе
				Если Найти(ВыходныеДни, Строка(ДеньНедели(Дат))) Тогда
					Запись.ЗначениеЧасы = 0;
					Запись.ЗначениеДни = 0;
				Иначе	          
					Запись.ЗначениеЧасы = КолвоЧасов;
					Запись.ЗначениеДни = 1;
				КонецЕсли
			КонецЕсли;
			Дат = Дат + ЧислоСекундВСутках;
		КонецЕсли; 
		Запись.ГрафикРаботы = ГрафикРаботы;
	КонецЦикла;
	Набор.Записать();
	
	Пока Дат <= ДатаОкончания Цикл
		Запись = Набор.Добавить();
		Запись.Дата = Дат;
		Если Найти(ВыходныеДни, Строка(ДеньНедели(Дат))) Тогда
			Запись.ЗначениеЧасы = 0;
			Запись.ЗначениеДни = 0;
		Иначе	          
			Запись.ЗначениеЧасы = КолвоЧасов;
			Запись.ЗначениеДни = 1;
		КонецЕсли; 
		Дат = Дат + ЧислоСекундВСутках;
		Запись.ГрафикРаботы = ГрафикРаботы;
	КонецЦикла; 
	Набор.Записать();
КонецПроцедуры
